"""

🆃🅴🅽🅽🅸🆂 🆃🅴🅽🅽🅸🆂 🆃🅴🅽🅽🅸🆂 🆃🅴🅽🅽🅸🆂🆃🅴🅽🅽🅸🆂 🆃🅴🅽🅽🅸🆂 🆃🅴🅽🅽🅸🆂 🆃🅴🅽🅽🅸🆂 🆃🅴🅽🅽🅸🆂 🆃🅴🅽🅽🅸🆂

                        █▀▀ ▄▀█ █▀ █░█ █ █▀█ █▄░█   █▀█ █▀▀ █▀ █▀█ █░█ █▀█ █▀▀ █▀▀ █▀
                        █▀░ █▀█ ▄█ █▀█ █ █▄█ █░▀█   █▀▄ ██▄ ▄█ █▄█ █▄█ █▀▄ █▄▄ ██▄ ▄█
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣀⣀⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣴⠞⠋⠉⠉⠉⠣⡀⠿⣦⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣠⣔⣦⠤⢴⣦⡀⠀⠀⡖⣲⣷⠃⠀⢀⠀⠀⠀⠀⠑⡄⠀⠙⢝⣦⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣤⠮⠛⠉⠁⠀⣀⠀⠘⣿⠖⣺⣷⣿⡏⠀⠀⣾⠇⢄⠀⠠⠀⠙⣄⠀⠀⠘⢶⣦⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣰⠟⠋⠀⠀⠀⠀⣠⣯⣿⣿⣿⣾⣉⣙⠻⢿⡀⢸⣿⠀⠄⠱⡀⠀⠀⠘⡄⠀⢠⡖⠲⣟⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣰⡚⠁⢀⠀⠀⠀⣀⡼⠋⣁⣀⠀⠀⠀⣹⣿⣗⣾⣷⡿⣷⣀⠖⡄⠙⡆⠀⠀⣿⠀⣸⠁⡄⠈⢻⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣴⡟⣀⠔⠁⢠⠂⣸⡟⢀⣾⣽⣿⣷⣶⣦⣿⣯⣾⢿⡿⢸⣷⣃⠮⣄⡀⠹⡄⠀⣿⠀⢻⣤⠇⢸⣨⡻⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣴⡿⣏⡠⠃⠀⡠⢾⠞⣼⣿⢿⠛⢹⣼⣍⣽⠟⠋⠁⢀⢹⡟⣿⣿⣿⣷⣌⠻⢦⣹⢀⡿⠀⠀⠉⠙⠋⢩⡟⣟⢄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⠁⣾⠁⡠⠊⢠⢣⡞⢻⢹⣘⡦⠟⠋⠉⠉⣤⣤⣄⡸⢸⣧⣿⢾⣿⣿⡟⢷⣄⠙⢄⣇⠀⠀⠀⠀⠀⠀⡇⠈⠛⢶⢤⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣧⡃⢀⣼⠊⣠⠔⢁⡞⠀⠈⣿⣻⣷⡿⡆⠀⠀⠉⠿⠋⡇⣼⡎⢘⡿⠛⢻⣿⣄⠻⣆⢸⣿⡀⠀⠀⠀⠀⠀⣷⢀⠠⠀⣈⠚⠳⣤⠤⣤⣀⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⡻⢛⠃⡜⢁⠐⡼⣀⣀⢠⣿⠏⣾⡆⠀⠀⠀⠀⠀⡼⢠⣷⣧⡞⠁⠀⠀⠙⣿⡌⠈⠀⡏⣇⠀⠀⠀⠀⠀⣏⢯⠑⠂⠀⠀⠀⠀⠊⢉⠛⠚⠻⠴⣦⣤⣀⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡾⢡⠇⠀⠀⡂⣸⡷⢡⡶⢋⢠⣾⣽⣥⡀⠀⠀⢀⣾⣻⣿⡟⣿⠀⠀⠀⠀⠀⠘⣿⡀⠠⢹⡼⣦⠀⠀⠀⠀⠘⢆⠻⣗⣮⣴⠀⠀⠀⠂⠈⠁⠀⠑⠦⡈⠉⠺⠵⣦⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⣧⠃⡀⠀⡞⣱⣿⣹⡿⣼⣿⢡⢾⣹⣗⣿⣷⣶⣺⠛⡇⢸⣶⠟⠋⠻⢶⡄⠀⠀⠈⣳⣄⠀⠳⣌⠳⡄⠀⠀⢀⡀⠑⠘⢷⡛⠻⠷⢦⣀⠢⢄⠀⠀⠀⠉⠱⢄⠙⢌⠪⣷⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣾⠎⠀⠀⣼⣵⣯⡷⣿⠓⣧⡿⣸⠸⣿⡿⠟⡟⠋⠀⠀⠳⡈⣿⢆⠂⠤⠈⣾⣆⠀⠀⠈⢻⢢⡀⠉⠷⣌⠲⢄⡀⠀⠀⠀⠀⠈⠉⠓⠒⠚⠟⠲⠝⠶⠤⣤⣀⣀⠑⣄⢳⡈⠻⣧⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⡾⠊⢀⣠⣾⡿⠃⣾⡑⣿⠰⠷⣷⠘⠀⣿⠁⣼⡿⢤⠠⢤⣼⣿⡿⢤⡉⠀⠀⠘⣿⡄⠀⠀⠀⠙⢟⣦⡄⠉⣟⢲⠬⣝⣒⡀⠀⠀⠀⠀⠀⠀⠀⠈⠀⠀⠀⠀⠀⠀⠈⠉⡑⠛⠦⢼⣿⣤⢄⡀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⣤⡶⢋⣠⣴⡿⢗⡟⠁⣼⣏⣇⣿⣤⣤⡏⠀⢰⠏⣺⣿⣧⣼⣦⣽⣾⣿⣷⡠⡱⡄⠀⠀⠘⣿⡀⠀⠀⠀⠀⠹⡽⡀⠀⢨⢧⠢⣄⢉⡉⡉⢉⠉⠛⠚⢛⡶⣶⣶⣶⢶⣒⣒⣆⠒⠒⠒⡶⡒⠒⣚⠙⠚⠷⢤⣤⡀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡤⣴⠯⠛⣁⣮⣽⣾⠟⠠⠊⣠⣾⡿⠋⢻⡶⢿⡴⠀⢀⡞⣼⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⣷⡷⡀⠀⠀⢸⣧⣀⢀⣀⣀⣠⣻⣷⠀⠘⣮⣡⡾⢄⠐⢄⡀⢀⠀⠀⠛⠳⢶⡉⣿⡆⠀⠘⣿⡀⠀⠀⣿⣯⡦⡈⢢⠀⠀⠀⠉⠻⢆⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⡠⠔⢏⣭⣴⣾⣿⡯⣟⠿⠃⣀⣴⡾⠟⠉⢀⠔⠉⠀⡰⠃⣐⡞⠀⠹⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡻⣷⡀⠀⠀⢻⣿⣯⣷⣬⣬⣙⡛⠓⠲⠯⣽⣧⡈⠳⣄⠉⠑⠚⠤⠄⣀⠸⣧⠿⣧⠀⠀⢹⡁⠀⠀⣿⣿⣿⠙⡄⢣⠀⠀⠀⠀⠈⠳⡀⠀
⠀⠀⠀⠀⠀⠀⢀⣾⠛⢺⣿⣿⣿⣿⣿⢋⣡⣶⣯⠟⠁⠀⠀⢠⠊⠀⢀⡼⡡⢺⣏⣠⣴⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⡿⠛⠛⠒⠒⢤⡙⢿⣾⣳⣭⢷⣛⣥⢒⠂⠀⠈⠓⢤⡈⠑⢦⡀⠀⠀⠀⠀⠈⠲⣌⣶⢤⣼⡁⠀⠀⣿⣿⡿⢠⣷⡀⠇⠀⠀⠀⠀⠀⠐⡀
⠀⠀⠀⠀⠀⢀⣿⡏⡄⣾⣿⢿⣿⣿⢿⣿⣝⡞⠁⠀⠀⠀⡰⠁⢀⢴⣋⣥⣶⢿⢿⣫⣶⡾⠛⠻⣧⣞⠻⣿⣿⣿⣿⣿⠋⠀⠀⠀⠨⠒⢂⣇⠀⠙⢯⡟⣽⢺⠼⣍⠖⡀⠀⠀⠀⠙⡖⢦⡉⣲⣄⠀⠀⠀⠀⠀⠉⢿⡻⠲⠀⣸⣿⣿⣕⣿⢿⡆⠀⠀⠀⠀⠀⠀⠀⢰
⠀⠀⠀⠀⠀⡼⠿⠐⣿⠼⣿⠿⣩⣿⠟⣡⠞⠠⠄⢀⣤⣪⠴⡮⠿⠿⢿⣿⣭⣿⡿⢟⡽⠉⠃⠰⣉⣿⣿⣿⣿⣿⣿⣿⣄⣴⣿⣿⣷⠀⠘⣿⣦⣀⠀⠻⣧⢏⡟⣬⠳⣤⠀⠀⠀⠀⢹⠊⠉⣸⠀⠙⠲⢤⡀⠀⠀⠀⠉⠻⣴⣿⣿⣷⣮⣿⣿⣧⠀⠀⠀⠀⠀⠀⠀⠘
⠀⠀⠀⠀⠀⢹⣦⠀⠘⣿⠏⡐⢡⢏⡰⠆⠈⣠⠴⠋⠁⡴⣫⣶⣿⣿⣿⣾⡿⠛⣿⠠⣄⠀⠀⡄⠠⠿⣿⣿⣿⣿⣿⣿⣯⣮⣟⣉⣡⠀⠀⣹⣿⠙⣷⡄⠀⠙⢾⡱⢏⠶⣉⢆⢠⡴⠚⣧⣤⣇⣀⣀⠀⠀⠨⡑⠲⠶⠦⣤⣌⣛⡺⣿⣿⣴⣿⡗⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⢻⣦⣠⠏⡐⢠⡹⠊⠁⢀⣩⠔⠋⢀⡞⢽⣿⣽⣚⣧⢟⣾⣿⣷⣿⣦⣀⢄⡐⠂⢀⣼⣿⣿⣿⣿⣿⣿⣥⣿⡈⢻⡟⠚⠻⠡⢻⡗⢻⡇⡀⠀⠀⣝⢯⠳⣍⢲⣼⠁⢠⣿⣿⣿⡷⣿⠟⠉⠓⣾⣆⢴⡀⢻⢻⣿⣿⣿⠿⣿⠟⠀⡀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⣸⣯⣷⡚⢉⠀⣠⠴⠛⠀⣰⠋⣿⣀⠘⠁⣿⢻⡜⣯⢞⡽⢫⣟⡟⣻⢿⣿⣧⣼⢿⡟⠿⠛⠋⠁⠂⠀⠀⠉⠧⣈⠳⢤⡀⢠⡛⢞⣾⢻⣆⡆⢺⣾⢛⣻⣿⣯⣤⣿⣽⣿⣿⠟⣁⠢⣉⣾⡿⣿⢸⡗⡌⢦⡉⢿⣿⣿⠊⢀⠔⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⢀⣴⠟⠋⣼⣉⣽⡏⠈⠀⠀⢀⣰⠧⠶⢿⡜⣧⡀⢧⣫⠿⣜⢯⣞⡳⢮⡜⡱⢎⠴⡁⠊⣸⠂⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⢳⣤⢟⢢⠹⣬⣏⣷⣻⣷⠎⢀⣿⣿⣿⢯⣿⣿⣿⢚⢡⣒⣤⡿⣿⣿⡾⣏⡿⡸⡘⠦⡑⣺⠞⣁⠴⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⣰⠟⠁⠀⠀⠈⠟⠉⠁⠀⠀⠀⢘⣧⣴⣆⡭⠟⠚⠛⢧⣏⡟⣮⢳⣭⢳⡇⣯⠱⣎⠲⣙⢲⡏⢀⡀⠀⠀⢀⠀⡀⢀⠄⣠⣐⣢⡘⣬⡾⠋⢁⣠⣼⣿⣿⣶⣿⣿⣿⣿⣿⣿⣫⣜⢶⣯⡿⠾⠟⣿⣿⣿⠛⡅⢣⣙⣴⡿⠗⠋⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢘
⠀⣠⡞⠁⠎⠀⠀⠀⠀⠀⣀⣤⡴⠒⠋⡉⠀⢿⡟⡛⢦⡀⠀⠀⠙⢾⠛⠉⠈⠙⢾⣱⣻⡬⠗⠺⢦⣅⢎⣴⠽⠒⠮⢴⣥⠾⠊⢁⣠⣌⣉⣉⣀⣴⣿⣿⣿⣿⣯⣿⣿⣿⣼⣿⣫⢿⣿⣿⠟⠉⣀⣠⢤⣾⣟⣡⠶⢬⣷⣯⣴⣤⢤⣤⠴⠚⠛⠓⡆⠀⠀⠀⠀⠀⠀⠐
⢠⠟⠀⠠⠀⡐⢀⡤⠶⣿⣿⣿⣟⠦⣀⠙⠲⢼⡇⢻⡀⠽⣦⣤⣤⣾⣷⣶⣄⡀⠀⢈⣠⣽⡶⣄⡀⠙⢋⣤⣴⣶⣦⣤⣠⣤⣞⣿⣿⣿⣿⣿⣿⡿⢯⡿⠟⠞⠋⠉⠀⣿⣟⠥⢺⣹⣿⣿⠳⠒⠓⠋⣉⡁⠠⠄⣦⣾⣻⡹⢆⣾⡉⠀⠀⠀⠀⠀⠣⠀⠀⠀⠀⠀⠀⠀
⡞⠀⡰⠁⡠⠞⠁⠀⠐⡌⠙⢿⣿⣿⣿⣷⣶⣖⣽⣼⣷⣦⠙⣿⣿⣿⣽⢿⣿⣿⣿⠿⣿⣿⣿⣿⣿⣾⣿⣿⣷⣿⣿⣿⣿⣿⡿⠿⡟⣛⠛⣹⣿⠉⠉⠁⠀⠀⠀⠀⢠⡇⣿⣈⡧⠛⠁⠀⣀⡠⠔⠊⠁⠀⢈⣶⡔⠉⢹⣴⠟⠉⠙⠒⠀⠀⠀⠀⣀⣤⡴⠋⣰⠃⠀⠀
⡇⢀⢃⠜⠁⠀⠀⠀⢀⠘⣧⢦⡨⡙⠾⠯⢿⡿⠿⠟⢋⣹⢶⣀⠻⢿⣿⣙⣛⠚⠹⠯⢿⣻⢛⣛⡓⢚⠛⢭⢩⣿⣿⣿⠱⣢⢙⠢⠐⠠⠃⡿⡇⠀⠀⠀⠀⢀⣀⣠⣤⣿⡿⣁⣠⣴⣺⠟⠉⠀⠀⢀⠤⠊⠉⠀⠀⠀⠀⠉⣀⣠⣤⣤⣶⢶⠾⠭⠀⣋⣰⡾⠋⠀⠀⠀
⡇⢸⠎⠀⠀⠀⠀⠀⠀⠂⠼⣧⡹⢧⣛⡌⠣⠌⡀⣄⣾⡿⠶⠯⢷⡿⣾⣗⣾⠆⠀⢠⣿⠇⠀⠀⠙⠣⣜⠠⣿⢞⣯⣼⣣⠶⠛⠉⠀⠀⢠⣿⠁⠀⠀⠀⠀⣮⣥⢿⡿⣍⡷⢯⣿⠟⠁⠀⢀⠠⠊⠁⠀⠀⠀⢀⡠⠔⣺⣹⣽⣤⣷⣾⣾⣽⠋⠉⢹⣿⠃⠀⠀⠀⠀⠀
⣿⣾⠀⠀⠀⠀⠀⠀⠈⢌⠢⡙⣷⡏⣭⢻⣿⣟⣭⡟⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡸⡏⠀⠀⠀⠀⠀⠈⣱⠏⠀⢿⣟⠁⠀⠀⠀⠀⠀⣸⣾⠀⠀⠀⠀⠀⠈⣿⣟⠢⣿⣤⡼⠃⠀⢀⠔⠁⠀⠀⠀⠀⠀⣰⣿⡫⠿⠋⠉⠀⠀⠀⣰⡿⠃⠀⣰⡿⠃⠀⠀⠀⠀⠀⠀
⠈⢣⡀⠀⠀⠀⠀⠀⡁⢢⠑⡴⢡⢟⣶⣋⠶⣝⣟⡆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢰⣷⠃⠀⠀⠀⠀⠀⣰⡽⠀⠀⣇⣿⠀⠀⠀⠀⠀⢀⣿⠃⠀⠀⠀⠀⠀⢸⣿⠁⢸⣿⡿⢃⠀⡰⠃⠀⠀⢀⠀⢀⣬⣾⡟⠋⠀⠀⠀⠀⠀⠀⠸⣵⡳⢀⢴⠏⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠈⠟⣄⠀⠀⠀⠐⡈⢄⠣⡒⡍⡞⡼⣍⣟⢲⡎⡽⣴⣢⠀⠀⠀⠀⠀⠀⠀⢀⣾⡖⠀⠀⠀⠀⠀⣰⣿⠀⠀⠀⢸⡏⠀⠀⠀⠀⠀⣸⡏⠀⠀⠀⠀⠀⠀⠸⣿⠀⠀⣷⠃⢰⢞⣡⡖⠀⠀⠘⢀⣾⣷⡟⠀⠀⠀⠀⠀⠀⠀⠀⠀⠯⠥⠞⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠙⢷⣄⡀⠠⢁⠎⣡⠱⣜⣜⡱⡍⢎⠃⠞⡱⢌⠹⠹⠾⢖⣲⠀⠀⢀⣸⣿⠂⠀⠀⠀⢀⣼⣿⠁⠀⠀⢠⡼⣄⠀⠀⠀⠀⢀⣿⠀⠀⠀⠀⠀⠀⠀⠀⢿⣆⠀⡎⠀⢸⡼⡁⣿⠀⠄⠠⠀⢺⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠙⠹⢶⠬⣆⣥⢓⡴⢪⣥⣉⣮⣘⣂⣱⠬⣶⣟⣹⠿⠚⢠⣶⡾⠓⠁⠀⠀⠀⢀⣾⠟⠀⠀⠀⠀⢈⣷⡇⠀⠀⠀⠀⣼⡿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠯⣷⡇⠀⢸⣇⠰⣿⠈⡌⡁⢧⠀⢻⣇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠉⠓⠚⠛⠽⠿⠯⠵⠶⠻⠿⠿⠿⠁⠀⠀⠀⣴⣿⠋⠀⠀⠀⠀⠀⣠⡿⠟⠀⠀⠀⠀⠀⢸⣾⠀⠀⠀⠀⢸⣿⡆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠸⣻⡄⠸⡙⡆⢽⡖⣴⢛⡞⡷⣄⠙⣗⣄⠀⠀⠀⠀⢠⢦⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣰⡿⠁⠀⠀⠀⠀⣠⣾⠏⠀⠀⠀⠀⠀⠀⠀⠘⣾⡆⠀⠀⠀⠀⠈⢫⣦⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠹⣿⡄⣇⢹⡴⣻⣜⣏⢾⡱⣏⡻⣦⣙⡻⢖⢲⣴⣾⢻⡁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⡿⠁⠀⠀⢀⣄⢴⠟⠃⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⢳⡢⠀⠀⠀⠀⠀⢫⣧⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠘⣝⣽⡎⠽⣗⢻⣞⢮⢱⢣⡍⢬⠻⣝⢿⣾⠾⡱⣿⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣞⠇⠀⠀⠀⣰⣿⠃⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢿⡅⠀⠀⠀⠀⠀⣿⡆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠙⢽⣖⣈⣷⣌⡳⣅⡊⠜⠣⡙⣌⣛⡷⢷⣫⠿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡤⢄⣼⣿⠀⠀⢀⣮⡿⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢿⡤⠀⠀⠀⠀⢸⣳⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⠓⠚⠭⠍⠟⠛⠝⠏⠛⠒⠋⠉⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣻⣶⣿⣼⣧⣔⣿⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢹⣦⠀⠀⠀⠀⣿⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣰⠿⢿⣿⣿⣍⣳⣾⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠓⣷⡄⠀⠀⢸⡧⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⡇⠀⠀⠈⣹⡻⢭⣃⡧⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⢾⣄⠀⠀⠹⣷⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣾⡇⠀⠀⢀⣿⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠹⣆⠀⠀⠈⠻⣢⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⡟⠀⠀⢠⣞⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡻⡆⠀⠣⡀⠈⣷⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠸⡄⠀⠀⠼⣾⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡳⡇⠀⠀⠀⣼⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠙⢴⣀⣂⣸⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠛⣇⠀⠀⢠⣿⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣼⡍⠀⠀⠀⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣴⠟⠁⠀⢀⣰⡟⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠧⠽⠦⠼⠽⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
Clothing Classes, Functions, Dependant variables, Constants for the Animal Crossing: Pocket Camp.py! Tweak and add
more clothing that will be used inside the entire program here there is a module for items as well in the 'Item.py'
script file with objects used within the game.

🆃🅴🅽🅽🅸🆂 🆃🅴🅽🅽🅸🆂 🆃🅴🅽🅽🅸🆂 🆃🅴🅽🅽🅸🆂 🆃🅴🅽🅽🅸🆂🆃🅴🅽🅽🅸🆂 🆃🅴🅽🅽🅸🆂 🆃🅴🅽🅽🅸🆂 🆃🅴🅽🅽🅸🆂 🆃🅴🅽🅽🅸🆂
"""

# import modules 
from dataclasses import dataclass
import logging, logging.handlers

# define logger
def logger(): # GenesisGir's typical logger preset! 
    
    # importing modules
    import logging, logging.handlers
    from logging.handlers import SMTPHandler
    
    # create the logger and set severity
    logger = logging.getLogger(__name__)
    logger.setLevel(logging.DEBUG) # set logger lvl

    # create handles and set their severity
    
    #File Handlers
    file_handler = logging.FileHandler( 
    filename = r"GenesisGirLessonsVOL.3\Lessons\AnimalCrossing\Logs\AnimalCrossingPocketCamp.log",
    mode = 'w', # filemode 
    encoding = 'utf-8', 
    delay = False, 
    errors = None)
    file_handler.setLevel(logging.DEBUG)
    
    #Stream Handlers
    stream_handler = logging.StreamHandler()
    stream_handler.setLevel(logging.CRITICAL)

    
    # create formatter
    formatter = logging.Formatter("%(asctime)s [%(name)s] [%(levelname)s] [Lvl:%(levelno)s] [%(funcName)s] [%(lineno)d] %(message)s",
    datefmt='%m/%d/%Y %I:%M:%S %p')

    # add formatter to handles
    file_handler.setFormatter(formatter)
    stream_handler.setFormatter(formatter)
    
    
    # adding the handler
    logger.addHandler(file_handler)
    logger.addHandler(stream_handler)
    
    return logger
    pass

# logger variable
logger = logger()


""" 𝗳𝗮𝘀𝗵𝗶𝗼𝗻 """
# class constants
#item catagory themes
CUTE = "Cute"
HIP = "Hip"
COOL = "Cool"
ELEGANT = "Elegant"
SPORTY = "Sporty"
HARMONIOUS = "Harmonious"
DRAIN = "Draingang"
NATURAL = "Natural"
MODERN = "Modern"
RUSTIC = "Rustic"
HISTORIC = "Historic"
CIVIC = "Civic"
HISTORICAL = "Historical"

# log info
logger.info("Clothing item category themes constants were defined successfully")

@dataclass()
class Clothes:
    
    # attributes
    name: str 
    clothing_type: str
    theme: str


# clothes object instances
# tops
pajama_top = Clothes("Pajama top", "Top", CUTE)
kuromi_tee = Clothes("Kuromi Tee", "Top", CUTE)
academic_hha_jacket	 = Clothes("Academic HHA Jacket	", "Top", CUTE)
aqua_polka_tee = Clothes("Aqua Polka Tee", "Top", CUTE)
aqua_spring_outerwear = Clothes("Aqua Spring Outerwear", "Top", CUTE)
usahana_tee = Clothes("Usahana Tee", "Top", CUTE)

# log info
logger.info("tops object instances were defined successfully")

# bottoms
pajama_pants = Clothes("Pajama pants", "Bottoms", CUTE)
black_formal_pants = Clothes("Black Formal Pants", "Bottoms", DRAIN)
bone_pants = Clothes("Bone Pants", "Bottoms", DRAIN)
dry_denim_skirt = Clothes("Dry-Denim Skirt", "Bottoms", DRAIN)
lavender_chiffon_skirt = Clothes("Lavender Chiffon Skirt", "Bottoms", CUTE)
isabelles_skirt = Clothes("Isabelle's Skirt", "Bottoms", CUTE)

# log info
logger.info("bottoms object instances were defined successfully")

# Dresses
black_sailor_pinafore = Clothes("Black Sailor Pinafore", "Dress", CUTE)
black_sakura_hakama = Clothes("Black Sakura Hakama", "Dress", CUTE)
black_yukata_dress= Clothes("Black Yukata Dress", "Dress", CUTE)
blue_mail_room_dress = Clothes("Blue Mail-Room Dress", "Dress", CUTE)
blue_tuxedo_set = Clothes("Blue Tuxedo Set", "Dress", ELEGANT)

# log info
logger.info("Dresses object instances were defined successfully")

# Handheld Accessories
berry_ice_cream_cone = Clothes("Berry Ice Cream Cone", "Handheld", CUTE)
black_purrfect_plushie = Clothes("Black Purrfect Plushie", "Handheld", NATURAL)
green_watering_can = Clothes("Green Watering Can", "Handheld", NATURAL)
gudetama_fan = Clothes("Gudetama Fan", "Handheld", CUTE)
handheld_can_of_soda = Clothes("Handheld Can of Soda", "Handheld", SPORTY)

# log info
logger.info("Handheld Accessories object instances were defined successfully")

# Hats
angelic_wig = Clothes("Angelic Wig", "Hat", NATURAL)
apple_stem	 = Clothes("Apple Stem", "Hat", HIP)
black_ram_horn_wig = Clothes("Black Ram-Horn Wig", "Hat", NATURAL)
blue_ombre_antler_wig = Clothes("Blue Ombre Antler Wig", "Hat", HARMONIOUS)
bunny_hood = Clothes("Bunny Hood", "Hat", CUTE)

# log info
logger.info("Hat object instances were defined successfully")

# Face
black_jewel_thief_mask = Clothes("Black Jewel-Thief Mask", "Face", ELEGANT)
doctors_mask= Clothes("Doctor's Mask", "Face", NATURAL)
halloween_face_paint = Clothes("Halloween Face Paint", "Face", HIP)
post_op_patch = Clothes("Post-Op Patch", "Face", COOL)
snowy_crystal_earrings = Clothes("Snowy Crystal Earrings", "Face", ELEGANT)

# log info
logger.info("Face object instances were defined successfully")

# Backpiece
angelic_wings = Clothes("Angelic Wings", "Backpiece", ELEGANT)
bat_friends = Clothes("Bat Friends", "Backpiece", COOL)
black_kitty_backpack = Clothes("Black Kitty Backpack", "Backpiece", COOL)
blue_hydrangea_obi = Clothes("Blue Hydrangea Obi", "Backpiece", HARMONIOUS)
dark_angel_wings = Clothes("Dark Angel Wings", "Backpiece", ELEGANT)

# log info
logger.info("Backpiece object instances were defined successfully")

# Shoes
blue_spring_moccasins = Clothes("Blue Spring Moccasins", "Shoes", NATURAL)
brown_santa_boots = Clothes("Brown Santa Boots	", "Shoes", CUTE)
lavender_pumps = Clothes("Lavender Pumps	", "Shoes", CUTE)
pastel_purple_pumps	 = Clothes("Pastel-Purple Pumps	", "Shoes", CUTE)
pink_rubber_rain_boots = Clothes("Pink Rubber Rain Boots", "Shoes", NATURAL)

# log info
logger.info("Shoes object instances were defined successfully")

# Socks
pajama_slippers = Clothes("Pajama slippers", "Socks", CUTE)
black_stockings = Clothes("Black Stockings", "Socks", COOL)
bobby_socks	= Clothes("Bobby Socks", "Socks", CUTE)
crimson_striped_socks = Clothes("Crimson Striped Socks", "Socks", COOL)
purple_star_socks = Clothes("Purple Star Socks", "Socks", HIP)
white_stockings	= Clothes("White Stockings", "Socks", COOL)

# log info
logger.info("Sock object instances were defined successfully")

# Outfits
starry_pajama_suit = Clothes("Pajama pants", "Outfit", CUTE)
animal_crossing_ski_suit = Clothes("Animal Crossing Ski Suit", "Outfit", SPORTY)
mario_outfit = Clothes("Mario Outfit", "Outfit", HIP)
eevee_costume = Clothes("Eevee Costume", "Outfit", CUTE)
foxtail_dress = Clothes("Foxtail Dress", "Outfit", HARMONIOUS)
zipper_costume = Clothes("Zipper Costume", "Outfit", HIP)

# log info
logger.info("Outfit object instances were defined successfully")